; domain
(define (domain driverlog)
  (:requirements :typing :fluents) 
  (:types           location locatable - object
		driver truck obj - locatable)

  (:predicates 
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)
  (:functions 	(time-to-walk ?l1 ?l2 - location)
		(time-to-drive ?l1 ?l2 - location)
		(fuel-used)
		(fuel-per-minute ?t - truck)
		(load ?t - truck)
  )


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck) (increase (load ?truck) 1)
		(increase (fuel-per-minute ?truck) (+ (load ?truck) 1))))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc) (decrease (load ?truck) 1)
		(decrease (fuel-per-minute ?truck) (load ?truck))))


(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
		(increase (fuel-used) (* (fuel-per-minute ?truck) (time-to-drive ?loc-from ?loc-to)))))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))

 
)

; problem
(define (problem DLOG-2-2-5-228)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	truck1 - truck
	truck2 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	p6-3 - location
	p6-4 - location
	p1-0 - location
	p1-2 - location
	p2-4 - location
	p2-6 - location
	p0-2 - location
	p3-0 - location
	p3-4 - location
	p5-3 - location
	p5-6 - location
	)
	(:init
	(at driver1 s6)
	(at driver2 s2)
	(at truck1 s5)
	(empty truck1)
	(= (load truck1) 0)
	(= (fuel-per-minute truck1) 10)
	(at truck2 s3)
	(empty truck2)
	(= (load truck2) 0)
	(= (fuel-per-minute truck2) 10)
	(at package1 s4)
	(at package2 s1)
	(at package3 s1)
	(at package4 s2)
	(at package5 s4)
	(path s6 p6-3)
	(path p6-3 s6)
	(path s3 p6-3)
	(path p6-3 s3)
	(= (time-to-walk s6 p6-3) 2)
	(= (time-to-walk p6-3 s6) 2)
	(= (time-to-walk s3 p6-3) 28)
	(= (time-to-walk p6-3 s3) 28)
	(path s6 p6-4)
	(path p6-4 s6)
	(path s4 p6-4)
	(path p6-4 s4)
	(= (time-to-walk s6 p6-4) 24)
	(= (time-to-walk p6-4 s6) 24)
	(= (time-to-walk s4 p6-4) 14)
	(= (time-to-walk p6-4 s4) 14)
	(path s1 p1-0)
	(path p1-0 s1)
	(path s0 p1-0)
	(path p1-0 s0)
	(= (time-to-walk s1 p1-0) 18)
	(= (time-to-walk p1-0 s1) 18)
	(= (time-to-walk s0 p1-0) 11)
	(= (time-to-walk p1-0 s0) 11)
	(path s1 p1-2)
	(path p1-2 s1)
	(path s2 p1-2)
	(path p1-2 s2)
	(= (time-to-walk s1 p1-2) 26)
	(= (time-to-walk p1-2 s1) 26)
	(= (time-to-walk s2 p1-2) 14)
	(= (time-to-walk p1-2 s2) 14)
	(path s2 p2-4)
	(path p2-4 s2)
	(path s4 p2-4)
	(path p2-4 s4)
	(= (time-to-walk s2 p2-4) 14)
	(= (time-to-walk p2-4 s2) 14)
	(= (time-to-walk s4 p2-4) 5)
	(= (time-to-walk p2-4 s4) 5)
	(path s2 p2-6)
	(path p2-6 s2)
	(path s6 p2-6)
	(path p2-6 s6)
	(= (time-to-walk s2 p2-6) 18)
	(= (time-to-walk p2-6 s2) 18)
	(= (time-to-walk s6 p2-6) 2)
	(= (time-to-walk p2-6 s6) 2)
	(path s0 p0-2)
	(path p0-2 s0)
	(path s2 p0-2)
	(path p0-2 s2)
	(= (time-to-walk s0 p0-2) 25)
	(= (time-to-walk p0-2 s0) 25)
	(= (time-to-walk s2 p0-2) 14)
	(= (time-to-walk p0-2 s2) 14)
	(path s3 p3-0)
	(path p3-0 s3)
	(path s0 p3-0)
	(path p3-0 s0)
	(= (time-to-walk s3 p3-0) 17)
	(= (time-to-walk p3-0 s3) 17)
	(= (time-to-walk s0 p3-0) 1)
	(= (time-to-walk p3-0 s0) 1)
	(path s3 p3-4)
	(path p3-4 s3)
	(path s4 p3-4)
	(path p3-4 s4)
	(= (time-to-walk s3 p3-4) 9)
	(= (time-to-walk p3-4 s3) 9)
	(= (time-to-walk s4 p3-4) 1)
	(= (time-to-walk p3-4 s4) 1)
	(path s5 p5-3)
	(path p5-3 s5)
	(path s3 p5-3)
	(path p5-3 s3)
	(= (time-to-walk s5 p5-3) 22)
	(= (time-to-walk p5-3 s5) 22)
	(= (time-to-walk s3 p5-3) 25)
	(= (time-to-walk p5-3 s3) 25)
	(path s5 p5-6)
	(path p5-6 s5)
	(path s6 p5-6)
	(path p5-6 s6)
	(= (time-to-walk s5 p5-6) 6)
	(= (time-to-walk p5-6 s5) 6)
	(= (time-to-walk s6 p5-6) 3)
	(= (time-to-walk p5-6 s6) 3)
	(link s6 s1)
	(link s1 s6)
	(= (time-to-drive s6 s1) 5)
	(= (time-to-drive s1 s6) 5)
	(link s6 s4)
	(link s4 s6)
	(= (time-to-drive s6 s4) 19)
	(= (time-to-drive s4 s6) 19)
	(link s3 s6)
	(link s6 s3)
	(= (time-to-drive s3 s6) 13)
	(= (time-to-drive s6 s3) 13)
	(link s4 s3)
	(link s3 s4)
	(= (time-to-drive s4 s3) 12)
	(= (time-to-drive s3 s4) 12)
	(link s5 s1)
	(link s1 s5)
	(= (time-to-drive s5 s1) 10)
	(= (time-to-drive s1 s5) 10)
	(link s5 s3)
	(link s3 s5)
	(= (time-to-drive s5 s3) 21)
	(= (time-to-drive s3 s5) 21)
	(link s5 s6)
	(link s6 s5)
	(= (time-to-drive s5 s6) 27)
	(= (time-to-drive s6 s5) 27)
	(link s2 s0)
	(link s0 s2)
	(= (time-to-drive s2 s0) 27)
	(= (time-to-drive s0 s2) 27)
	(link s2 s1)
	(link s1 s2)
	(= (time-to-drive s2 s1) 22)
	(= (time-to-drive s1 s2) 22)
	(link s2 s5)
	(link s5 s2)
	(= (time-to-drive s2 s5) 28)
	(= (time-to-drive s5 s2) 28)
	(link s0 s1)
	(link s1 s0)
	(= (time-to-drive s0 s1) 12)
	(= (time-to-drive s1 s0) 12)
	(link s0 s4)
	(link s4 s0)
	(= (time-to-drive s0 s4) 10)
	(= (time-to-drive s4 s0) 10)
	(link s0 s6)
	(link s6 s0)
	(= (time-to-drive s0 s6) 1)
	(= (time-to-drive s6 s0) 1)
	(= (fuel-used) 0)
)
	(:goal (and
	(at driver2 s2)
	(at truck1 s4)
	(at package1 s0)
	(at package2 s6)
	(at package3 s3)
	(at package4 s4)
	(at package5 s1)
	))

(:metric minimize (+ (* 2 (total-time)) (* 4 (fuel-used))))

)

; plan
1. (walk driver1 s6 p5-6)
   deleted: (at driver1 s6)
   added: (at driver1 p5-6)
   goals met: 1 of 7
2. (walk driver1 p5-6 s5)
   deleted: (at driver1 p5-6)
   added: (at driver1 s5)
   goals met: 1 of 7
3. (board-truck driver1 truck1 s5)
   deleted: (at driver1 s5) (empty truck1)
   added: (driving driver1 truck1)
   goals met: 1 of 7
4. (drive-truck truck1 s5 s1 driver1)
   deleted: (at truck1 s5)
   added: (at truck1 s1)
   changed: (fuel-used) from 0 to 100
   goals met: 1 of 7
5. (load-truck package3 truck1 s1)
   deleted: (at package3 s1)
   added: (in package3 truck1)
   changed: (load truck1) from 0 to 1, (fuel-per-minute truck1) from 10 to 11
   goals met: 1 of 7
6. (load-truck package2 truck1 s1)
   deleted: (at package2 s1)
   added: (in package2 truck1)
   changed: (load truck1) from 1 to 2, (fuel-per-minute truck1) from 11 to 13
   goals met: 1 of 7
7. (drive-truck truck1 s1 s0 driver1)
   deleted: (at truck1 s1)
   added: (at truck1 s0)
   changed: (fuel-used) from 100 to 256
   goals met: 1 of 7
8. (drive-truck truck1 s0 s4 driver1)
   deleted: (at truck1 s0)
   added: (at truck1 s4)
   changed: (fuel-used) from 256 to 386
   goals met: 2 of 7
9. (load-truck package1 truck1 s4)
   deleted: (at package1 s4)
   added: (in package1 truck1)
   changed: (load truck1) from 2 to 3, (fuel-per-minute truck1) from 13 to 16
   goals met: 2 of 7
10. (load-truck package5 truck1 s4)
   deleted: (at package5 s4)
   added: (in package5 truck1)
   changed: (load truck1) from 3 to 4, (fuel-per-minute truck1) from 16 to 20
   goals met: 2 of 7
11. (drive-truck truck1 s4 s0 driver1)
   deleted: (at truck1 s4)
   added: (at truck1 s0)
   changed: (fuel-used) from 386 to 586
   goals met: 1 of 7
12. (unload-truck package1 truck1 s0)
   deleted: (in package1 truck1)
   added: (at package1 s0)
   changed: (load truck1) from 4 to 3, (fuel-per-minute truck1) from 20 to 16
   goals met: 2 of 7
13. (drive-truck truck1 s0 s6 driver1)
   deleted: (at truck1 s0)
   added: (at truck1 s6)
   changed: (fuel-used) from 586 to 602
   goals met: 2 of 7
14. (unload-truck package2 truck1 s6)
   deleted: (in package2 truck1)
   added: (at package2 s6)
   changed: (load truck1) from 3 to 2, (fuel-per-minute truck1) from 16 to 13
   goals met: 3 of 7
15. (drive-truck truck1 s6 s3 driver1)
   deleted: (at truck1 s6)
   added: (at truck1 s3)
   changed: (fuel-used) from 602 to 771
   goals met: 3 of 7
16. (unload-truck package3 truck1 s3)
   deleted: (in package3 truck1)
   added: (at package3 s3)
   changed: (load truck1) from 2 to 1, (fuel-per-minute truck1) from 13 to 11
   goals met: 4 of 7
17. (drive-truck truck1 s3 s4 driver1)
   deleted: (at truck1 s3)
   added: (at truck1 s4)
   changed: (fuel-used) from 771 to 903
   goals met: 5 of 7
18. (drive-truck truck1 s4 s0 driver1)
   deleted: (at truck1 s4)
   added: (at truck1 s0)
   changed: (fuel-used) from 903 to 1013
   goals met: 4 of 7
19. (drive-truck truck1 s0 s1 driver1)
   deleted: (at truck1 s0)
   added: (at truck1 s1)
   changed: (fuel-used) from 1013 to 1145
   goals met: 4 of 7
20. (unload-truck package5 truck1 s1)
   deleted: (in package5 truck1)
   added: (at package5 s1)
   changed: (load truck1) from 1 to 0, (fuel-per-minute truck1) from 11 to 10
   goals met: 5 of 7
21. (drive-truck truck1 s1 s2 driver1)
   deleted: (at truck1 s1)
   added: (at truck1 s2)
   changed: (fuel-used) from 1145 to 1365
   goals met: 5 of 7
22. (load-truck package4 truck1 s2)
   deleted: (at package4 s2)
   added: (in package4 truck1)
   changed: (load truck1) from 0 to 1, (fuel-per-minute truck1) from 10 to 11
   goals met: 5 of 7
23. (drive-truck truck1 s2 s0 driver1)
   deleted: (at truck1 s2)
   added: (at truck1 s0)
   changed: (fuel-used) from 1365 to 1662
   goals met: 5 of 7
24. (drive-truck truck1 s0 s4 driver1)
   deleted: (at truck1 s0)
   added: (at truck1 s4)
   changed: (fuel-used) from 1662 to 1772
   goals met: 6 of 7
25. (unload-truck package4 truck1 s4)
   deleted: (in package4 truck1)
   added: (at package4 s4)
   changed: (load truck1) from 1 to 0, (fuel-per-minute truck1) from 11 to 10
   goals met: 7 of 7
